PureEngineering/PUREmodules/nrf52/modules_examples/dw1000_ble/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    //static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    uint8_t getChar;
    //static uint8_t index = 0;
    //uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
        	UNUSED_VARIABLE(app_uart_get(&getChar));
			put_queue(&uart_rx_queue,(char) getChar);

        /*
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }*/
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER, //TODO: check this pin
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
	nrf_gpio_cfg_input(RX_PIN_NUMBER, NRF_GPIO_PIN_PULLUP);

	APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    //options.ble_adv_slow_enabled  = true;
    //options.ble_adv_slow_interval = APP_ADV_INTERVAL_SLOW;
    //options.ble_adv_slow_timeout  = 0;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 *//*
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}*/


uint8_t spiRead(uint8_t addr)
{
	uint8_t address = addr & 0x7F;
	uint8_t buffer[3];
	int length =2;
	buffer[0] = address;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, buffer, length, buffer, length));

	while (!spi_xfer_done)
	{
		__WFE();
	}

	return buffer[1];
}

void spiWrite(uint8_t addr, uint8_t data)
{
	uint8_t address = addr | 0x80;
	uint8_t buffer[3];
	buffer[0] = address;
	buffer[1] = data;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, buffer, 2, buffer, 2));

	while (!spi_xfer_done)
	{
		__WFE();
	}

	//read back check
}

void bleTxProcessQueue(void)
{
	char rxChar;
	int numToSend = 0;
	char send_buffer[50];

	while(get_queue(&ble_tx_queue,&rxChar) )
	{
		send_buffer[numToSend++] = rxChar;

		if(numToSend >= 20)
		{
			break;
		}
	}

	if(numToSend)
	{
		ble_nus_string_send(&m_nus, (uint8_t *)send_buffer, numToSend);
	}
}

void app_loop(void)
{
	char rxChar;

	//loraTx( testdata, 5); //just for testing.

	//loraRx(); //check for LoRa RX. 

	while(get_queue(&uart_rx_queue,&rxChar) )
	{
		//put_queue(&lora_tx_queue,rxChar);
		put_queue(&ble_tx_queue,rxChar);
	}
	bleTxProcessQueue();

	while(get_queue(&ble_rx_queue,&rxChar) )
	{
		app_uart_put(rxChar);
		//put_queue(&lora_tx_queue,rxChar);
	}

	while(get_queue(&dw1000_rx_queue,&rxChar) )
	{
	//	app_uart_put(rxChar);
		put_queue(&ble_tx_queue,rxChar);
	}
	bleTxProcessQueue();
	
	//loraTxProcessQueue();
}






//Code that runs in main to read data from sensors that are on
void print_to_ble(){
    if(ble_on){
    	//sprintf((char *)ble_string, "dw1000 inside print: %x \r\n",0x54);
    	//send_ble_data(m_nus,(uint8_t *)ble_string,length);

