PureEngineering/PUREmodules/nrf52/modules_examples/dw1000_ble/main.c
        //run_lis2de_ble(m_twi_master,m_nus);
        DEBUG_PRINTF("\r\nPrint to BLE!\r\n");
    }
}

APP_TIMER_DEF(sensor_loop_timer_id);

static void sensor_loop_handler(void * p_context)
{
   print_to_ble();  
}

static void create_sensor_timer()
{   
    uint32_t err_code;

    // Create timers
    err_code = app_timer_create(&sensor_loop_timer_id, APP_TIMER_MODE_REPEATED, sensor_loop_handler);
    APP_ERROR_CHECK(err_code);

     err_code = app_timer_start(sensor_loop_timer_id, APP_TIMER_TICKS(1200, APP_TIMER_PRESCALER), NULL);
     APP_ERROR_CHECK(err_code);
}



uint8_t dw1000_whoami(){
	uint8_t id = spiRead(0x00);
	return id;
}




/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
	nrf_gpio_pin_dir_set(18,NRF_GPIO_PIN_DIR_INPUT);

    /* Initializing SPI interface for DW1000 */
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    bsp_board_leds_init();
    uart_init();


    printf("\r\nDW1000 Start!\r\n");

	init_queue(&uart_rx_queue,uart_rx_buffer,MAX_QUEUE_SIZE);
	init_queue(&ble_rx_queue,ble_rx_buffer,MAX_QUEUE_SIZE);
	init_queue(&ble_tx_queue,ble_tx_buffer,MAX_QUEUE_SIZE);
	//init_queue(&lora_rx_queue,lora_rx_buffer,MAX_QUEUE_SIZE);
	//init_queue(&lora_tx_queue,lora_tx_buffer,MAX_QUEUE_SIZE);

	//TODO: check pin8 functionality
	//nrf_gpio_cfg_output(8);
	//nrf_gpio_pin_clear(8);  //turn off GPS

	//SPI setup
	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	spi_config.ss_pin   = SPI_SS_PIN;
	spi_config.miso_pin = SPI_MISO_PIN;
	spi_config.mosi_pin = SPI_MOSI_PIN;
	spi_config.sck_pin  = SPI_SCK_PIN;

	APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
	
	//nrf_gpio_pin_dir_set(14,NRF_GPIO_PIN_DIR_OUTPUT);
	//nrf_gpio_pin_set(14);  //reset Lora
	//DEBUG_PRINTF(" Reset\n\r");
	//nrf_gpio_pin_dir_set(14,NRF_GPIO_PIN_DIR_INPUT);

	DEBUG_PRINTF("DW1000 Init\n\r");



	DEBUG_PRINTF("BLE start\n\r");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);


    create_sensor_timer();

    uint8_t length = 14;
	//uint8_t *ble_string[length];
	char ble_string[length];
    // Enter main loop.
    for (;;)
    {
    	
    	//for (uint32_t i = 0; i < length; i++)
		//{
			//put_queue(&dw1000_rx_queue,ble_string[i]);
		//}
	//err_code = sd_app_evt_wait();
	//APP_ERROR_CHECK(err_code);
    //send_ble_data(m_nus,(uint8_t *)ble_string,length);
	//NRF_LOG_RAW_INFO("DW1000 talking \r\n");
    	uint8_t id = dw1000_whoami();
    	sprintf(ble_string, "dw1000 id: %x \r\n",id);
		ble_nus_string_send(&m_nus, (uint8_t *)ble_string, length);

		nrf_delay_ms(2000);
		//app_loop();
    }
}


/**
 * @}
 */
